Repository: sebastianstein/placeholder
Catalog: Resources/Private/Language/Backend/*.locallang.xlf
Languages: de

# tx_placeholder_domain_model_placeholder
source: Placeholder
de: Platzhalter

# show-placeholder
source: Show placeholder content
de: Platzhalter Inhalt anzeigen

# hide-placeholder
source: Hide placeholder content
de: Platzhalter Inhalt verstecken

# TCA.placeholder.marker_identifier
source: Identifier
de: Marker Name

# TCA.placeholder.description
source: Description
de: Beschreibung

# TCA.placeholder.value
source: Value
de: Inhalt

# error.marker.invalidName.title
source: The given placeholder name is not valid!
de: Der Platzhalter Name ist nicht gültig!

# error.marker.invalidName.message
source: Entry contains invalid characters! Only capital letters "A-Z", "0-9" and "-+" allowed. The correct syntax is ###MY-PLACEHOLDER###
de: Die Eingabe enthält nicht erlaubte Zeichen! Nur Großbuchstaben „A-Z“, „0-9“ und „-+“ sind erlaubt. Die korrekte Schreibweise lautet ###MEIN-PLATZHALTER###

# error.marker.invalidSyntax.title
source: Paceholder syntax not valid
de: Platzhalter Syntax nicht gültig

# error.marker.invalidSyntax.message
source: The first three and last three characters must be '#' (e.g. ###MY-PLACEHOLDER###)
de: Die ersten und letzten drei Zeichen müssen „#“ sein (z.B. ###MEIN-PLATZHALTER###)

# error.marker.identifierNotUnique.title
source: Not Unique
de: Name nicht einzigartig

# error.marker.identifierNotUnique.message
source: The placeholder dose already exist
de: Der angegebene Platzhalter existiert bereits
